<h1>Шаблонізація</h1>
<p>
    Приведення усіх сторінок сайту до однакового вигляду.
    Досягається (класично) двома підходами
</p>
<ul>
    <li>Відокремленням спільних частин та виключення їх до сторінок</li>
    <li>Створенням єдиного шаблону в середину якого встановлюються тіла сторінок</li>
</ul>
<p>
    Відокремлення частин простіше, дозволяє більш гнучко формувати відміності (на частині сторінок є ліве
    меню чи рекламний блок, а інших - немає)
</p>
<p>
    З шаблоном складніша маршрутизація, але зміни централізовані. Основна ідея полягає в наступному:
    всі маршрути ведуть на один шаблон, який, аналізуючи маршрут, підбирає конкретне тіло.
    Створення єдиної "точки" проходження запитів - це вимога "диспетчера доступу", яка диктується безпекою
</p>
<p>
    Реалізація - через налаштування сервера (Apache).
    Створюємо в корені проєкту файл <code>.htaccess</code>
    У налаштуваннях (vhost) додаэмо інструкцію:
    <code>AllowOverride All</code> яка дозволяє приймати додаткові налаштування серверу
</p>